---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllModelDescription
source: html/accb8b7d-e334-a5d6-fe81-9115f4e85891.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllModelDescription Property

"Description"

## Syntax (C#)
```csharp
public static ForgeTypeId AllModelDescription { get; }
```